Emacs.org
#+title: Emacs Config File
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes 

* Packages System setup
Sets up use package for easily installing all packages on a new system  
  #+begin_src emacs-lisp
  
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
  (package-refresh-contents))

   ;; Initialize use-package on non-Linux platforms
   (unless (package-installed-p 'use-package)
   (package-install 'use-package))

   
   (require 'use-package)
   (setq use-package-always-ensure t)

 


  #+end_src
  
* Basic UI Config

Configures basic UI elements such as font size, removing the menu bar, et.c.

  #+begin_src emacs-lisp
  
  (defvar barremacs/default-font-size 132)
  (defvar barremacs/var-pitch-font-size 160)

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room

  (menu-bar-mode -1)            ; Disable the menu bar

  ;; Set up the visible bell
  (setq visible-bell t)

  (column-number-mode)
  (global-display-line-numbers-mode t)

  (setq truncate-lines 1)

  #+end_src

**  Font Configuration

Configures Fira Code font for monospace and Cantarell for Variable Pitch font size (For Org mode et.al).

   #+begin_src emacs-lisp
   
   (defun barremacs/set-font-faces ()
     (message "Setting faces")
     (set-face-attribute 'default nil :font "Fira Code" :height barremacs/default-font-size)

     (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height barremacs/default-font-size)

     (set-face-attribute 'variable-pitch nil :font "Cantarell" :height barremacs/var-pitch-font-size))

   (if (daemonp)
       (add-hook 'after-make-frame-functions
                 (lambda (frame)
                   (setq doom-modeline-icon t)
                   (with-selected-frame frame
                     (barremacs/set-font-faces))))
       (barremacs/set-font-faces))



   #+end_src

* Spotify
** Spotify.el
#+begin_src emacs-lisp
; (use-package simple-httpd)

; (add-to-list 'load-path "/home/barre/BSE/")
; (require 'spotify)

;; Settings
; (setq spotify-oauth2-client-secret "230474a9a95446dd99bf6a6570e2aa8f")
; (setq spotify-oauth2-client-id "734b1bd830d74e5e9f761cc8b5e849d1")
; (define-key spotify-mode-map (kbd "C-c .") 'spotify-command-map)
; (setq spotify-transport 'connect)
#+end_src
** Counsel-Spotify
#+begin_src emacs-lisp

  (use-package counsel-spotify)
  (setq counsel-spotify-client-id "734b1bd830d74e5e9f761cc8b5e849d1")
  (setq counsel-spotify-client-secret "230474a9a95446dd99bf6a6570e2aa8f")

#+end_src

* Keybinding
Uses general to set global keybindings and custom C-c commands. 
** General 

#+begin_src emacs-lisp

    (use-package general
      :config
      (general-create-definer barremacs/leader-keys
        ;:keymaps '(normal insert visual emacs)
        :prefix "C-c"
        :global-prefix "C-c")

      (general-define-key
       "C-M-j" 'counsel-switch-buffer
       "C-M-," 'magit-status
       "C-M-k" 'kill-buffer-and-window
       "C-c a" 'org-agenda)  

      (barremacs/leader-keys
        "c"  '(:ignore c :which-key "code")
        "cc" '(comment-or-uncomment-region :which-key "comment") 
        "cs" '(lsp-treemacs-symbols :which-key "treemacs-symbols")
        "ct" '(treemacs :which-key "treemacs")
        "cr" '(lsp-treemacs-references :which-key "references")
        "t"  '(:ignore t :which-key "toggles")
        "tt" '(counsel-load-theme :which-key "choose theme")
         "s"  '(:ignore s :which-key "spotify")
         "sn" '(counsel-spotify-next :which-key "next")
         "sp" '(counsel-spotify-previous :which-key "previous")      
         "ss" '(counsel-spotify-search-track :which-key "search track")
         "sa" '(counsel-spotify-search-album :which-key "search album")
         "st" '(counsel-spotify-toggle-play-pause :which-key "play/pause")))


#+end_src

#+RESULTS:
: t

* UI Config
Basic UI configuration. 
** Command Log mode
Not useful really
#+begin_src emacs-lisp
(use-package command-log-mode)
#+end_src

** Color Theme
Sets Gruvbox dark as default theme. Use C-c tt to quickly switch to another theme. 
#+begin_src emacs-lisp

(use-package doom-themes
  :init (load-theme 'doom-gruvbox t))

#+end_src

** Better Modeline
Makes the modeline hella sexy. 
#+begin_src emacs-lisp

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

#+end_src

** Which Key
Shows all the keybinding completiosn when pressing a keybind.
#+begin_src emacs-lisp

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

#+end_src

** Ivy and Counsel
Completion framework for emacs. Counsel is the better looking find file and Swiper search. 
#+begin_src emacs-lisp

(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))



(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

;; NOTE: The first time you load your configuration on a new machine, you'll
;; need to run the following command interactively so that mode line icons
;; display correctly:
;;
;; M-x all-the-icons-install-fonts









(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history)))


#+end_src

** Helpful 
Helpful adds more information to the vanilla C-h help commands.
#+begin_src emacs-lisp

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

#+end_src

** Text Scaling (Hydra)

#+begin_src emacs-lisp

(use-package hydra)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(barremacs/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

* Org Mode
Org mode is a project planner, document editor, task & time tracker, blogging engine, and literate coding utility. All in one package.
** Better font faces
Configures text faces to edit heading size and font. Make it feel more like editing a document. 
   #+begin_src emacs-lisp

   (defun barremacs/org-font-setup ()
     ;; Replaces list hyphen with a dot
     (font-lock-add-keywords 'org-mode
			 '(("^ *\\([-]\\)"
			    (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

     ;;Set faces for heading levels
     (dolist (face '((org-level-1 . 1.2)
                     (org-level-2 . 1.1)
		     (org-level-3 . 1.05)
		     (org-level-4 . 1.0)
		     (org-level-5 . 1.1)
		     (org-level-6 . 1.1)
		     (org-level-7 . 1.1)
		     (org-level-8 . 1.1)))
         (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))


    ;;Ensure that anything that should be fixed pitch in org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))

    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
     			    


   #+end_src

